programming/misc/glossary.org
#+setupfile: ../../styles/readtheorg.setup
#+title: Glossary

* 辨析

| argument    | 实参（方法调用）                           |
| parameter   | 形参（方法定义）                           |
|-------------+--------------------------------------------|
| attribute   | 特性（原本就具有的，如目录的特性）         |
| property    | 属性（主动赋予的，与对象有关）             |
|-------------+--------------------------------------------|
| call        | 调用（有意）                               |
| invoke      | 激活？（可能非有意）                       |
|-------------+--------------------------------------------|
| function    | 函数（和对象无关）                         |
| method      | 方法（和对象相关）                         |
|-------------+--------------------------------------------|
| overload    | 重载（同一个类中，方法名相同，参数不同）   |
| override    | 覆盖（继承关系中，函数签名相同，实现不同） |
| overwrite   | 重写（基类函数被隐藏？）                   |
|-------------+--------------------------------------------|
| parse       | 解析                                       |
| resolve     | 解析                                       |
|-------------+--------------------------------------------|
| demo        |                                            |
| dummy       |                                            |
| fake        |                                            |
| mock        |                                            |
| pseudo      |                                            |
|-------------+--------------------------------------------|
| agnostic    |                                            |
| independent |                                            |
| neutral     |                                            |

* 词汇
** 编程

| access            | 访问     |
|-------------------+----------|
| alias             | 别名     |
|-------------------+----------|
| application       | 应用     |
|-------------------+----------|
| archive           | 存档     |
|-------------------+----------|
| associative array | 关联数组 |
|-------------------+----------|
| build             | 构建     |
|-------------------+----------|
| cast              | 类型转换 |
|-------------------+----------|
| component         | 组件     |
|-------------------+----------|
| concurrent        | 并发     |
|-------------------+----------|
| construct         | 构造     |
|-------------------+----------|
| constructor       | 构造函数 |
|-------------------+----------|
| create            | 创建     |
|-------------------+----------|
| daemon            | 守护进程 |
|-------------------+----------|
| dependency        | 依赖     |
|-------------------+----------|
| deprecate         | 弃用     |
|-------------------+----------|
| destructor        | 析构函数 |
|-------------------+----------|
| directive         | 指令     |
|-------------------+----------|
| directory         | 目录     |
|-------------------+----------|
| explicit          | 显式     |
|-------------------+----------|
| expression        | 表达式   |
|-------------------+----------|
| extension         | 扩展     |
|-------------------+----------|
| failover          | 故障切换 |
|-------------------+----------|
| field             | 域       |
|-------------------+----------|
| global            | 全局     |
|-------------------+----------|
| handle            | 句柄     |
|-------------------+----------|
| hash              | 散列     |
|-------------------+----------|
| identifier        | 标识符   |
|-------------------+----------|
| implement         | 实现     |
|-------------------+----------|
| implicit          | 隐式     |
|-------------------+----------|
| instantiate       | 实例化   |
| instantiation     |          |
|-------------------+----------|
| integration       | 集成     |
|-------------------+----------|
| interprete        | 解释     |
|-------------------+----------|
| iterate           | 迭代     |
|-------------------+----------|
| join              | 联合     |
|-------------------+----------|
| literal           | 字面量   |
|-------------------+----------|
| key               | 键       |
|-------------------+----------|
| macro             | 宏       |
|-------------------+----------|
| mapping           | 映射     |
|-------------------+----------|
| match             | 匹配     |
|-------------------+----------|
| module            | 模块     |
|-------------------+----------|
| namespace         | 命名空间 |
|-------------------+----------|
| operand           | 操作数   |
|-------------------+----------|
| operator          | 运算符   |
|-------------------+----------|
| option            | 选项     |
|-------------------+----------|
| overhead          | 开销     |
|-------------------+----------|
| parse             | 解析     |
|-------------------+----------|
| partition         | 分区     |
|-------------------+----------|
| path              | 路径     |
|-------------------+----------|
| permission        | 权限     |
|-------------------+----------|
| persistent        | 持久化的 |
|-------------------+----------|
| predefined        | 预定义的 |
|-------------------+----------|
| primitive type    | 原始类型 |
|-------------------+----------|
| property          | 属性     |
|-------------------+----------|
| redirection       | 重定向   |
|-------------------+----------|
| remote            | 远程     |
|-------------------+----------|
| resolve           | 解析     |
|-------------------+----------|
| response          | 响应     |
|-------------------+----------|
| scalar            | 标量     |
|-------------------+----------|
| session           | 会话     |
|-------------------+----------|
| set               | 集合     |
|-------------------+----------|
| specification     | 规格     |
|-------------------+----------|
| statement         | 声明     |
|-------------------+----------|
| subscript         | 下标     |
|-------------------+----------|
| token             | 标记     |
|-------------------+----------|
| traversal         | 遍历     |
|-------------------+----------|
| truncate          | 截断     |
|-------------------+----------|
| visibility        | 可见性   |

** 数学

| associative | 可结合的       |
|-------------+----------------|
| commutative | 可交换的       |
|-------------+----------------|
| cumulative  | 累积的         |
|-------------+----------------|
| derivative  | 导数           |
|-------------+----------------|
| diagonal    | 对角的，对角线 |
|-------------+----------------|
| monotonic   | 单调的         |
|-------------+----------------|
| quadratic   | 二次的         |
|-------------+----------------|
| tangent     | 切线           |

** 字符

| =-=                          | hyphen                      |
|------------------------------+-----------------------------|
| =_=                          | underscore                  |
|------------------------------+-----------------------------|
| =.=                          | dot, period                 |
|------------------------------+-----------------------------|
| =*=                          | asterisk                    |
|------------------------------+-----------------------------|
| @@html:<code>'</code>@@      | single quote, tick          |
|------------------------------+-----------------------------|
| =`=                          | backquote, backtick         |
|------------------------------+-----------------------------|
| =~=                          | tilde                       |
|------------------------------+-----------------------------|
| =^=                          | caret                       |
|------------------------------+-----------------------------|
| @@html:<code>&#124;</code>@@ | pipe                        |
|------------------------------+-----------------------------|
| =()=                         | parentheses, round brackets |
|------------------------------+-----------------------------|
| =[]=                         | square brackets             |
|------------------------------+-----------------------------|
| ={}=                         | curly brackets, braces      |

* 定义
** boilerplate

Code that have to be included in many places with little or no alteration.

** canary
** caveat

A warning or proviso of specific stipulations, conditions, or limitations.

** cut over

To move information or users of a computer system to a new place or equipment at the same time, or in an order that causes as few problems as possible.

** dry run

A rehearsal of a performance or procedure before the real one.

** on-premises

On-premises software is installed and runs on computers on the premises of the person using the software, rather than at a remote facility such as a server farm or cloud. In contrast, off-premises software is commonly called "Software as a Service (SaaS)" or "cloud computing".

** payload

The part of transmitted data that is the actual intended message, excluding any headers or metadata sent solely to facilitate payload delivery.

** port

To transfer (software) from one system or machine to another.

** proof-of-concept

Proof of Concept (PoC) is a realization of a certain method or idea in order to demonstrate its feasibility, or a demonstration in principle with the aim of verifying that some concept or theory has practical potential. A proof of concept is usually small and may not be complete.

** shim

A small library that transparently intercepts API calls and changes the arguments passed, handles the operation itself or redirects the operation elsewhere.

** sporadic

Occasional, infrequent, irregular, scattered, isolated.

Occurring at irregular intervals or only in a few places.

** stopgap

A temporary way of dealing with a problem or satisfying a need.

** triage

Assign degrees of urgency to (wounded or ill patients).
