programming/misc/glossary.html
---
title: "Glossary"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-23 Sat 21:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Glossary</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Glossary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c37476">1. 辨析</a></li>
<li><a href="#org6c10a54">2. 词汇</a>
<ul>
<li><a href="#org9a41ee8">2.1. 编程</a></li>
<li><a href="#org023a4ba">2.2. 数学</a></li>
<li><a href="#org2344254">2.3. 字符</a></li>
</ul>
</li>
<li><a href="#org33709a7">3. 定义</a>
<ul>
<li><a href="#org267274c">3.1. boilerplate</a></li>
<li><a href="#org5c5e564">3.2. canary</a></li>
<li><a href="#org59a6934">3.3. caveat</a></li>
<li><a href="#orgd76fed5">3.4. cut over</a></li>
<li><a href="#org8d0b46d">3.5. dry run</a></li>
<li><a href="#org85683a8">3.6. on-premises</a></li>
<li><a href="#org1878fad">3.7. payload</a></li>
<li><a href="#orgca0d745">3.8. port</a></li>
<li><a href="#org5a4c282">3.9. proof-of-concept</a></li>
<li><a href="#org5ec67c2">3.10. shim</a></li>
<li><a href="#org86f7b6d">3.11. sporadic</a></li>
<li><a href="#orgd30e294">3.12. stopgap</a></li>
<li><a href="#orgd48f278">3.13. triage</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7c37476" class="outline-2">
<h2 id="org7c37476"><span class="section-number-2">1</span> 辨析</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">argument</th>
<th scope="col" class="org-left">实参（方法调用）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">parameter</td>
<td class="org-left">形参（方法定义）</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">attribute</th>
<th scope="col" class="org-left">特性（原本就具有的，如目录的特性）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">property</td>
<td class="org-left">属性（主动赋予的，与对象有关）</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">call</th>
<th scope="col" class="org-left">调用（有意）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">invoke</td>
<td class="org-left">激活？（可能非有意）</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">function</th>
<th scope="col" class="org-left">函数（和对象无关）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">method</td>
<td class="org-left">方法（和对象相关）</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">overload</th>
<th scope="col" class="org-left">重载（同一个类中，方法名相同，参数不同）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">override</td>
<td class="org-left">覆盖（继承关系中，函数签名相同，实现不同）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">overwrite</td>
<td class="org-left">重写（基类函数被隐藏？）</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">parse</th>
<th scope="col" class="org-left">解析</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">resolve</td>
<td class="org-left">解析</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">demo</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dummy</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fake</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">mock</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">pseudo</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6c10a54" class="outline-2">
<h2 id="org6c10a54"><span class="section-number-2">2</span> 词汇</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9a41ee8" class="outline-3">
<h3 id="org9a41ee8"><span class="section-number-3">2.1</span> 编程</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">access</th>
<th scope="col" class="org-left">访问</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">alias</td>
<td class="org-left">别名</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">application</td>
<td class="org-left">应用</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">archive</td>
<td class="org-left">存档</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">associative array</td>
<td class="org-left">关联数组</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">build</td>
<td class="org-left">构建</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">cast</td>
<td class="org-left">类型转换</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">component</td>
<td class="org-left">组件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">concurrent</td>
<td class="org-left">并发</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">construct</td>
<td class="org-left">构造</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">constructor</td>
<td class="org-left">构造函数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">create</td>
<td class="org-left">创建</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">daemon</td>
<td class="org-left">守护进程</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">dependency</td>
<td class="org-left">依赖</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">deprecate</td>
<td class="org-left">弃用</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">destructor</td>
<td class="org-left">析构函数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">directive</td>
<td class="org-left">指令</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">directory</td>
<td class="org-left">目录</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">explicit</td>
<td class="org-left">显式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">expression</td>
<td class="org-left">表达式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">extension</td>
<td class="org-left">扩展</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">failover</td>
<td class="org-left">故障切换</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">field</td>
<td class="org-left">域</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">global</td>
<td class="org-left">全局</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">handle</td>
<td class="org-left">句柄</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">hash</td>
<td class="org-left">散列</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">identifier</td>
<td class="org-left">标识符</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">implement</td>
<td class="org-left">实现</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">implicit</td>
<td class="org-left">隐式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">instantiate</td>
<td class="org-left">实例化</td>
</tr>

<tr>
<td class="org-left">instantiation</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">integration</td>
<td class="org-left">集成</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">interprete</td>
<td class="org-left">解释</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">iterate</td>
<td class="org-left">迭代</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">join</td>
<td class="org-left">联合</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">literal</td>
<td class="org-left">字面量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">key</td>
<td class="org-left">键</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">macro</td>
<td class="org-left">宏</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">mapping</td>
<td class="org-left">映射</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">match</td>
<td class="org-left">匹配</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">module</td>
<td class="org-left">模块</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">namespace</td>
<td class="org-left">命名空间</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">operand</td>
<td class="org-left">操作数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">operator</td>
<td class="org-left">运算符</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">option</td>
<td class="org-left">选项</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">overhead</td>
<td class="org-left">开销</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">parse</td>
<td class="org-left">解析</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">partition</td>
<td class="org-left">分区</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">path</td>
<td class="org-left">路径</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">permission</td>
<td class="org-left">权限</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">persistent</td>
<td class="org-left">持久化的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">predefined</td>
<td class="org-left">预定义的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">primitive type</td>
<td class="org-left">原始类型</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">property</td>
<td class="org-left">属性</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">redirection</td>
<td class="org-left">重定向</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">remote</td>
<td class="org-left">远程</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">resolve</td>
<td class="org-left">解析</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">response</td>
<td class="org-left">响应</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">scalar</td>
<td class="org-left">标量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">session</td>
<td class="org-left">会话</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">set</td>
<td class="org-left">集合</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">specification</td>
<td class="org-left">规格</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">statement</td>
<td class="org-left">声明</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">subscript</td>
<td class="org-left">下标</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">token</td>
<td class="org-left">标记</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">traversal</td>
<td class="org-left">遍历</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">truncate</td>
<td class="org-left">截断</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">visibility</td>
<td class="org-left">可见性</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org023a4ba" class="outline-3">
<h3 id="org023a4ba"><span class="section-number-3">2.2</span> 数学</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">associative</th>
<th scope="col" class="org-left">可结合的</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">commutative</td>
<td class="org-left">可交换的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">cumulative</td>
<td class="org-left">累积的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">derivative</td>
<td class="org-left">导数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">diagonal</td>
<td class="org-left">对角的，对角线</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">monotonic</td>
<td class="org-left">单调的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">quadratic</td>
<td class="org-left">二次的</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">tangent</td>
<td class="org-left">切线</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2344254" class="outline-3">
<h3 id="org2344254"><span class="section-number-3">2.3</span> 字符</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>-</code></th>
<th scope="col" class="org-left">hyphen</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>_</code></td>
<td class="org-left">underscore</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>.</code></td>
<td class="org-left">dot, period</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">asterisk</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>'</code></td>
<td class="org-left">single quote, tick</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>`</code></td>
<td class="org-left">backquote, backtick</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>~</code></td>
<td class="org-left">tilde</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">caret</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&#124;</code></td>
<td class="org-left">pipe</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>()</code></td>
<td class="org-left">parentheses, round brackets</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>[]</code></td>
<td class="org-left">square brackets</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>{}</code></td>
<td class="org-left">curly brackets, braces</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org33709a7" class="outline-2">
<h2 id="org33709a7"><span class="section-number-2">3</span> 定义</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org267274c" class="outline-3">
<h3 id="org267274c"><span class="section-number-3">3.1</span> boilerplate</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Code that have to be included in many places with little or no alteration.
</p>
</div>
</div>

<div id="outline-container-org5c5e564" class="outline-3">
<h3 id="org5c5e564"><span class="section-number-3">3.2</span> canary</h3>
</div>
<div id="outline-container-org59a6934" class="outline-3">
<h3 id="org59a6934"><span class="section-number-3">3.3</span> caveat</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A warning or proviso of specific stipulations, conditions, or limitations.
</p>
</div>
</div>

<div id="outline-container-orgd76fed5" class="outline-3">
<h3 id="orgd76fed5"><span class="section-number-3">3.4</span> cut over</h3>
<div class="outline-text-3" id="text-3-4">
<p>
To move information or users of a computer system to a new place or equipment at the same time, or in an order that causes as few problems as possible.
</p>
</div>
</div>

<div id="outline-container-org8d0b46d" class="outline-3">
<h3 id="org8d0b46d"><span class="section-number-3">3.5</span> dry run</h3>
<div class="outline-text-3" id="text-3-5">
<p>
A rehearsal of a performance or procedure before the real one.
</p>
</div>
</div>

<div id="outline-container-org85683a8" class="outline-3">
<h3 id="org85683a8"><span class="section-number-3">3.6</span> on-premises</h3>
<div class="outline-text-3" id="text-3-6">
<p>
On-premises software is installed and runs on computers on the premises of the person using the software, rather than at a remote facility such as a server farm or cloud. In contrast, off-premises software is commonly called "Software as a Service (SaaS)" or "cloud computing".
</p>
</div>
</div>

<div id="outline-container-org1878fad" class="outline-3">
<h3 id="org1878fad"><span class="section-number-3">3.7</span> payload</h3>
<div class="outline-text-3" id="text-3-7">
<p>
The part of transmitted data that is the actual intended message, excluding any headers or metadata sent solely to facilitate payload delivery.
</p>
</div>
</div>

<div id="outline-container-orgca0d745" class="outline-3">
<h3 id="orgca0d745"><span class="section-number-3">3.8</span> port</h3>
<div class="outline-text-3" id="text-3-8">
<p>
To transfer (software) from one system or machine to another.
</p>
</div>
</div>

<div id="outline-container-org5a4c282" class="outline-3">
<h3 id="org5a4c282"><span class="section-number-3">3.9</span> proof-of-concept</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Proof of Concept (PoC) is a realization of a certain method or idea in order to demonstrate its feasibility, or a demonstration in principle with the aim of verifying that some concept or theory has practical potential. A proof of concept is usually small and may not be complete.
</p>
</div>
</div>

<div id="outline-container-org5ec67c2" class="outline-3">
<h3 id="org5ec67c2"><span class="section-number-3">3.10</span> shim</h3>
<div class="outline-text-3" id="text-3-10">
<p>
A small library that transparently intercepts API calls and changes the arguments passed, handles the operation itself or redirects the operation elsewhere.
</p>
</div>
</div>

<div id="outline-container-org86f7b6d" class="outline-3">
<h3 id="org86f7b6d"><span class="section-number-3">3.11</span> sporadic</h3>
<div class="outline-text-3" id="text-3-11">
<p>
Occasional, infrequent, irregular, scattered, isolated.
</p>

<p>
Occurring at irregular intervals or only in a few places.
</p>
</div>
</div>

<div id="outline-container-orgd30e294" class="outline-3">
<h3 id="orgd30e294"><span class="section-number-3">3.12</span> stopgap</h3>
<div class="outline-text-3" id="text-3-12">
<p>
A temporary way of dealing with a problem or satisfying a need.
</p>
</div>
</div>

<div id="outline-container-orgd48f278" class="outline-3">
<h3 id="orgd48f278"><span class="section-number-3">3.13</span> triage</h3>
<div class="outline-text-3" id="text-3-13">
<p>
Assign degrees of urgency to (wounded or ill patients).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen</p>
<p class="date">Created: 2020-05-23 Sat 21:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
